let handler = m => m
handler.all = async function (m) {
let chat = global.db.data.chats[m.chat] 
     if (/^نشر$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, '*❋• ┈─━ ◞🌩◜ ━─┈ •❋*
*نرحب بكم في استقبال*
*◜元 ⊰🌩⊱‏Мαиji◞*
*❋• ┈─━ ◞🌩◜ ━─┈ •❋*

*◞⟐╎اعضاء متفاعلين🔥◜*
*◞⟐╎بنك ومتجر فخمين🏦◜*
*◞⟐╎مسابقات وفعاليات🏀◜*
*◞⟐╎قوانين عادلة📜◜*
*◞⟐╎سوالف ونقاشات🎭◜*
*◞⟐╎بوت سوالف وبوت مطور🤖◜*
*◞⟐╎مشرفين ذو خبرة🎖◜*
*◞⟐╎اذا صنم لا تجي🗿◜*
*❋• ┈─━ ◞🌩◜ ━─┈ •❋*
*●᚛|الاستقبال↯*
```https://chat.whatsapp.com/BYcNmfA9dbzDddTFrsAdoc```
*●᚛|من طرف↯*
〘•⊰⊱•〙
*❋• ┈─━ ◞🌩◜ ━─┈ •❋', m) //wm, null, [['Menu', '#menu']], m) botones :V

} 
    if (/^اوامر$/i.test(m.text) ) { //sem prefixo
    conn.reply(m.chat, `*~⌝˼‏ادارة⊰🌩⊱Мαиji˹⌞~*
*⎔ ⋅ ───━ •﹝🌩﹞• ━─── ⋅ ⎔*
*●↯┊🎮الــاوامـــــر🎮┊↯●*
*❆━━━ ─ • ❪🌩❫ • ─ ━━━❆*
*⧉⇇ترحيب⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇نشر⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇منوع⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية القلوب⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية صناديق الحظ⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇طرد مؤبد⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الروليت⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية كرة القدم⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الهاشيرا⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية ديث نوت⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الزومبي⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الباتل رويال⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الايموجي⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية شد الحبل⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇سؤال مفاجئ⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇اعلان ترقية⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الاصوات⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الروليت⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية كرة القدم⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الهوكاجي⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية مصاص الدماء⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇انذار⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇تحويل⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇طرد تأديبي⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇ملوك الاسبوع⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇تنازل⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇اعفاء⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅
❅*\n*⧉⇇مقولات⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇فعالية الابراج⇉*
*‏❅ ━ ── • 🌩 • ── ━ ❅*
*⧉⇇شراء سلعة⇉*
*❆━━━ ─ • ❪🌩❫ • ─ ━━━❆*
*❖╏تـوقــيــ✍︎ـع: -*
*◜Мαиji 🌩╎元◞*
*⎔ ⋅ ───━ •﹝🌩﹞• ━─── ⋅ ⎔*`, m) //wm, null, [['Menu', '#menu']], m) botones :V

}
 
return !0 }
export default handler
